HELYXcore-4.4.0/examples/legacy/multiphase/twoLiquidMixingFoam/lockExchange/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Dab         1e-06;
alphatab    1;

phases (sludge water);

sludge
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
}

water
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             990;
}

// ************************************************************************* //
